# DATABASES

In [2]:
#connection parameters
import mysql.connector

mysql_driver = 'mysql+pymysql'
mysql_server = '35.243.166.3'
mysql_uname = 'user1'
mysql_pwd = '123456'
mysql_host = 'localhost'
mysql_ports = '3306'
mysql_db = 'safaricom_2019'

db connected succesfully

In [4]:
db_conn = mysql.connector.connect(
host = mysql_server,
user = mysql_uname, 
passwd = mysql_pwd, 
database = mysql_db)
if db_conn:
    print("db connected succesfully")
else:
    print("Error db not connected")

db connected succesfully

In [7]:
#select
mycursor = db_conn.cursor()
query = "show tables"
mycursor.execute(query)
myresult = mycursor.fetchall()

for x in myresult:
    print(x)

('courses',)
('departments',)
('positions',)
('student_courses',)
('student_positions',)
('students',)

In [11]:
#select
mycursor = db_conn.cursor()
query = "select* from student_courses"
mycursor.execute(query)
myresult = mycursor.fetchall()

for x in myresult:
    print(x)

(1, 1, 10, 'Proactive detection and correction of security incidents')
(2, 2, 9, 'Smart Access Fault Detector and Corrector\r\nTime series analysis of customer churn and correlation of customer churn and product deployment.')
(3, 3, 9, 'Customer issues Management Automation\r\nIdentify customer impacting events in real time through CEM, social media feeds and customer care input. Automatically identify the most probable cause and trigger the next best action (policy, configuration, trouble ticket, etc.) in order to improve the customer experience for the most customers in real time')
(4, 4, 9, 'Fraudulent Transaction detecting on MPESA Paybills Account \xa0used for \xa0mobile \xa0banking.\r\nProactive detection of fraudulent transactions /activity \xa0on third party mpesa \xa0paybills(used for mobile banking) accounts and fail safe measures.')
(5, 5, 10, 'To be shared')
(6, 6, 1, 'Enabling our customers to do different services provisioning on different network platforms hence reducing/minimizing the operator controlled network changes.')
(7, 7, 10, 'Network and Applications Security Related Projects')
(8, 8, 10, 'Automate Network Load Balancer Provisioning.\r\nAutomate the mundane task of adding IP addresses and security certificates to enable Load balancing using a front end system to be used by developers.')
(9, 9, 10, 'Secure Authorized Access/exit using Face Recognition, Card Scanner and RFID (SAFscanneR)\r\nIn today’s world, companies struggles with loss of property in warehouses and office premises, to ensure there is no loss of company property, only authorized access/exit shall be granted via use of SAFscanneR.')
(10, 10, 10, 'Securing IoT Networks\r\nEnd to end design of secure and robust IoT networks security systems.\r\nProactive monitoring of threats and attacks to IoT networks systems.')
(11, 11, 5, 'Laptop Virtulisation\r\nRun all features and programs that users access from their laptops in the cloud. Users will be able to log in from any location as long as there is a screen connected to the cloud.')
(12, 12, 3, 'To be shared')
(13, 13, 1, '\r\nSmart Data Centres and Sites')
(14, 14, 5, 'Smart Access Fault Detector and Corrector\r\nProactive detection and correction of service degradation and improved time to restore\r\nEnd to end network analysis of the access network to proactively detect and recommend actions to mitigate service degradation/failure.')
(15, 15, 3, 'Continous Development and Automation of FTTH products & Processes\r\nBuild a pipeline to resolve issues in the management, development and operations of product release for FTTH ')
(16, 16, 5, 'Partners evaluation system ')
(17, 17, 1, 'Developing a smart home, access control monitoring, automated curtain drawing and shopping reminders.')
(18, 18, 9, 'To Share')
(19, 19, 9, 'Proactive detection and correction of\xa0 network quality issues\r\nProactive detection and correction of service degradation through predictive analysis of collected system data.\r\nExplore new revenue opportunities\r\nExploration of existing subscriber data and their consumer behavior to see if there is likelihood of new revenue streams or possibility of improving existing revenue streams ')
(20, 20, 9, 'Automation of access of various network information and smart planning using data analytics.\xa0 Use of big data analytics in automation of access of various network information like data, KPIs etc and develop an network smart planning tool using the available network information.')
(21, 21, 3, 'Automation of network configuration and service provisioning.\r\nThe project will speed up service configuration, simplify data poling from network devices. Through command versioning, this automation will eliminate human errors and ensuring faster service restoration.')
(22, 22, 9, 'Drive test analysis automation system using data Mining\r\nTo design a proactive system which seeks to automate the manual and tideous drive test process through signal sample collection and intelligent analysis and give recommendations.')
(23, 23, 9, 'Detection and automation of Network Issues\r\nProactive detection, analysis and automation of sector swaps issues.\r\nAutomation and reporting of RET configuration issues.\r\nEnd to end Radio network congestion issues, analysis of existing resources and automate recommendations. ')
(24, 24, 9, 'Application of Machine Learning and standard data analysis on Network Upgrade and Optimization.')
(25, 25, 4, 'A Web App for interns to interact, share ideas and track progress on their ideas and projects\r\nWill assist to engage them more in the life of the organization and to glean from them.\r\nAlso assist to identify talent and connect them to other opportunities.')
(26, 26, 9, 'M-Shwari\xa0 loan applications mapped to M-Pesa use vs Risk\r\nEnd to end mapping of M-Shwari loan applications and how the borrowers use the money in M-Pesa and the risk factor per use')
(27, 27, 4, 'Automation of the asset recording process at Safaricom premises.\r\nAutomation of the lease management process from site acquisition to payment.')
(28, 28, 9, 'To Share')
(29, 29, 3, 'Automation of RAN Suppport tasks\r\nAutomation of Repetitive support tasks , to create time for more proactive tasks')
(30, 30, 9, 'Use Data Analytics tools to identify business opportunities, growth trends for Safaricom.')
(31, 31, 1, 'Spare Installation Verification Tool\r\nInnovate on a way to confirm every spare that is installed at a BTS Site to verify invoicing. (Project may change during course of Studies)')
(32, 32, 4, 'Health check tool for RAN elements \r\nchecking of RAN elements status automatically. Give\xa0 a summary of software status, Parameter standardization , Feature activation and \xa0Fallback\xa0 validity. ')
(33, 33, 3, 'Transmission pacesetter system\r\nTo automate transmission system’s implementation, deployment and fault finding processes that historically have been manual and slow, to reduce the time between system planning to normal production as well as ease and speed up fault finding and resolution time.')
(34, 34, 9, 'Leveraging Machine Learning\r\nPredict and validate potential faults within the network through Artificial Intelligence and Machine learning.')
(35, 35, 4, 'Stock Management App -\xa0 A mobile application which will help small scale traders to track their stocks and monitor sales and purchases by utilizing QR code and barcode technology in their smart phones')
(36, 36, 1, 'A project on automation of network processes implementing IoT')
(37, 37, 10, 'Secure data transfer over the internet using image Steganography\r\nIt is the technique of hiding private or sensitive information within something that appears as an ordinary file or an image.')
(38, 38, 1, 'AUTOMATED NETWORK FUNCTION DEPLOYMENT AND PROVISIONING. \r\nAutomated provisioning of network elements using NFV and segmentao')
(39, 39, 10, 'Applied Cryptography In Proactive Protection\r\nApplication of cryptography to enhance 2 Factor Authentication (2FA)systems.')
(40, 40, 6, 'To be shared')
(41, 41, 7, 'Automation\r\n-Automation of access to text data or data from databases directly and creating visualizations. ')
(42, 42, 9, '\r\nRunning successful marketing campaigns in telco based on accurate customer behaviour and predictive patterns as told by numbers and analytics to , predict and influence customer behavior\r\nStrong awareness of market trends, competitive impacts and market opportunities for Higher Revenues and Reduced Churn Rates through proactive communications &\xa0 improved customer experience for target customer segments')
(43, 43, 9, '\r\nProactive detection and correction of service degradation and improved time to restore\r\nEnd to end network analysis of the access network to proactively detect and recommend actions to mitigate service degradation/failure.')
(44, 44, 9, 'Still brain storming.')
(45, 45, 9, 'Predict customer Churn through data analysis.')
(46, 46, 9, 'To be shared')
(47, 47, 10, 'End to end Security analysis of the Enterprise Business Solution products')
(48, 48, 8, 'To be shared')
(49, 49, 9, 'To be shared')
(50, 50, 3, 'Network Automation through python\r\nNetwork configuration through python from CRM platfroms embracing different network technologies with end to end network analysis of the access/core network to ensure correct service provisioning and proactively detect and recommend actions to mitigate service degradation/failure .')
(51, 51, 1, 'To implement 5G on SDN.\r\noverall design for the new radio network "5G"".')
(52, 52, 9, 'Big Data Manipulation\r\nBigg data manipulation and correlation (KPIs/Alarms/Logs/Capacity/Tx\r\n')
(53, 53, 3, 'To be shared')
(54, 54, 4, 'Web APP \r\nDevelop a Web App showcasing UX and UI as well as programing skills ')
(55, 55, 4, 'Bid Management System\r\nDevelop a web-based platform that eases bid management process right from identification of an opportunity to submission of proposal and any interactions thereafter.')
(56, 56, 9, 'To be shared')
(57, 57, 5, 'To be shared')
(58, 58, 1, 'To be shared')
(59, 59, 3, 'To be shared')
(60, 60, 4, 'To be shared')

# Lists

In [13]:
names = ['Jane','Janet','James','Jamey']
type(names)

list

In [17]:
fruits = ['Banana','Apple','Orange','Melon','Lemon']

In [18]:
count = 0
for item in fruits:
    count += 1
    print(count, item)

1 Banana
2 Apple
3 Orange
4 Melon
5 Lemon

In [20]:
for count,item in enumerate (fruits):
    print(count, item)

0 Banana
1 Apple
2 Orange
3 Melon
4 Lemon

In [21]:
fruits[2]

'Orange'

In [23]:
fruits[-2]

'Melon'

In [24]:
x = [1,2,3,4,5]
y = [6,7,8,9]
x+y

[1, 2, 3, 4, 5, 6, 7, 8, 9]

In [26]:
x[2]+y[2]

11

In [27]:
x*3

[1, 2, 3, 4, 5, 1, 2, 3, 4, 5, 1, 2, 3, 4, 5]

In [38]:
# cube all items in x and call them z
z = []
x = [1,2,3,4,5] 
for item in x:
    z.append(item**3)

print(z)

[1, 8, 27, 64, 125]

In [39]:
#method 2
a = [i**3 for i in x]
a

[1, 8, 27, 64, 125]

In [40]:
len (a)

5

In [41]:
students = ['Jane','Janet','James','Jamey','Ron']

In [43]:
w = (10,11,12,13)

In [45]:
w[1]

11

In [46]:
a = [[1,2], ['Dida', 'kaka'], [10,12]]
a

[[1, 2], ['Dida', 'kaka'], [10, 12]]

In [47]:
a [1][0]

'Dida'

In [48]:
a [1]

['Dida', 'kaka']

In [49]:
import numpy as np

In [51]:
a = np.array([1,2,3,4,5])
a

array([1, 2, 3, 4, 5])

In [56]:
a = np.array([[2,1],[1,0]])
b = np.array([4,1])

print (a.dot(b))

[9 4]

In [1]:
b = [[1,2], ['Dida', 'kaka'], [10,12]]
b

[[1, 2], ['Dida', 'kaka'], [10, 12]]

In [2]:
flat_list = [item for sublist in b for item in sublist]

In [4]:
for sublist in b:
    for item in sublist:
        flat_list.append(item)

In [3]:
lists = [['hello'], ['world', 'foo', 'bar']]
lists

[['hello'], ['world', 'foo', 'bar']]

In [1]:
import itertools

In [2]:
lists = [['hello'], ['world', 'foo', 'bar']]
combined = list(itertools.chain.from_iterable(lists))

In [3]:
lists = [item for items in lists for item in items]

# Dictionaries

In [2]:
safcom = {'names':'John'}
safcom

{'names': 'John'}

In [3]:
safcom2 = dict(grade=21)
safcom2

{'grade': 21}

In [4]:
names = ['Kim','Maina','James','Robert','Greg']
safcom = {'names': names}
grades = [70,60,73,68,83]
safcom2 = {'grades': grades}
safcom.update (safcom2)

In [5]:
safcom.keys()

dict_keys(['names', 'grades'])

In [26]:
safcom.values()

dict_values([['Kim', 'Maina', 'James', 'Robert', 'Greg'], [70, 60, 73, 68, 83]])

In [6]:
safcom.update(safcom2)
print (safcom)

{'names': ['Kim', 'Maina', 'James', 'Robert', 'Greg'], 'grades': [70, 60, 73, 68, 83]}

In [ ]:
for q, a in zip()

# pandas

In [7]:
import pandas as pd

In [8]:
df = pd.DataFrame({'names': names, 'grades':grades})
df

    names  grades
0     Kim      70
1   Maina      60
2   James      73
3  Robert      68
4    Greg      83

In [9]:
df = pd.DataFrame({'Names': names, 'Grades':grades})
df

    Names  Grades
0     Kim      70
1   Maina      60
2   James      73
3  Robert      68
4    Greg      83

In [10]:
df = pd.DataFrame({'names': names, 'english':grades})
df.names

0       Kim
1     Maina
2     James
3    Robert
4      Greg
Name: names, dtype: object

In [11]:
df = pd.DataFrame({'names': names, 'english':grades})
df['math'] = [87,86,80,70,73]
df

    names  english  math
0     Kim       70    87
1   Maina       60    86
2   James       73    80
3  Robert       68    70
4    Greg       83    73

In [12]:
df['math'].mean()

79.2

In [13]:
df['math'].sum()

396

In [14]:
df['math'].max()

87

In [15]:
df = pd.DataFrame({'names': names, 'english':grades})
df['math'] = [87,86,80,70,73]
df['science'] = (df['math'] +df['english'])/2
df

    names  english  math  science
0     Kim       70    87     78.5
1   Maina       60    86     73.0
2   James       73    80     76.5
3  Robert       68    70     69.0
4    Greg       83    73     78.0

In [16]:
df = pd.DataFrame({'names': names, 'english':grades})
df['math'] = [87,86,80,70,73]
df['science'] = (df['math'] +df['english'])/2
df['cre'] =df[['math', 'science']].min(axis=1)
df['social_studies'] =df[['math', 'english','science']].max(axis=1)
df

    names  english  math  science   cre  social_studies
0     Kim       70    87     78.5  78.5            87.0
1   Maina       60    86     73.0  73.0            86.0
2   James       73    80     76.5  76.5            80.0
3  Robert       68    70     69.0  69.0            70.0
4    Greg       83    73     78.0  73.0            83.0

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 6 columns):
names             5 non-null object
english           5 non-null int64
math              5 non-null int64
science           5 non-null float64
cre               5 non-null float64
social_studies    5 non-null float64
dtypes: float64(3), int64(2), object(1)
memory usage: 320.0+ bytes

In [18]:
df.describe()

         english       math    science        cre  social_studies
count   5.000000   5.000000   5.000000   5.000000         5.00000
mean   70.800000  79.200000  75.000000  74.000000        81.20000
std     8.348653   7.596052   3.984344   3.657185         6.83374
min    60.000000  70.000000  69.000000  69.000000        70.00000
25%    68.000000  73.000000  73.000000  73.000000        80.00000
50%    70.000000  80.000000  76.500000  73.000000        83.00000
75%    73.000000  86.000000  78.000000  76.500000        86.00000
max    83.000000  87.000000  78.500000  78.500000        87.00000

In [19]:
df['sum'] = df[df.columns].sum(axis=1)
df

    names  english  math  science   cre  social_studies    sum
0     Kim       70    87     78.5  78.5            87.0  401.0
1   Maina       60    86     73.0  73.0            86.0  378.0
2   James       73    80     76.5  76.5            80.0  386.0
3  Robert       68    70     69.0  69.0            70.0  346.0
4    Greg       83    73     78.0  73.0            83.0  390.0

In [20]:
df['sum']
df

    names  english  math  science   cre  social_studies    sum
0     Kim       70    87     78.5  78.5            87.0  401.0
1   Maina       60    86     73.0  73.0            86.0  378.0
2   James       73    80     76.5  76.5            80.0  386.0
3  Robert       68    70     69.0  69.0            70.0  346.0
4    Greg       83    73     78.0  73.0            83.0  390.0

In [22]:
def set_grade(row):
    if row["sum"]>= 400 and row["sum"] <= 500:
        return("You received an A")

    elif row["sum"] >= 350 and row["sum"] < 400:
        return("You received a A-")

    elif row["sum"] >= 300 and row["sum"] < 350:
        return("You received a B")

    elif row["sum"] >= 250 and row["sum"] < 300:
        return("You received a C")

    else:
        return("See the Dean for your results")
df= df.assign(grades=df.apply(set_grade, axis=1))
df

,names,english,math,science,cre,social_studies,sum,grades
0,Kim,70,87,78.5,78.5,87.0,401.0,You received an A
1,Maina,60,86,73.0,73.0,86.0,378.0,You received a A-
2,James,73,80,76.5,76.5,80.0,386.0,You received a A-
3,Robert,68,70,69.0,69.0,70.0,346.0,You received a B
4,Greg,83,73,78.0,73.0,83.0,390.0,You received a A-

In [8]:
def gradeScores (sum):
    if sum >= 90 and sum <= 100:
        return("You received an A")

    elif sum >= 80 and sum < 90:
        return("You received a B")

    elif sum >= 70 and sum < 80:
        return("You received a C")

    elif sum >= 60 and sum < 70:
        return("You received a D")

    else:
        return("Sorry, you received an F")

In [53]:
if sum >= 450and <= 500:
            return 'A'

SyntaxError: invalid syntax (<ipython-input-53-83e05b5f0907>, line 1)

In [54]:
input ('Please press "Enter" to begin')

while True:
    import math

    studentName = str(input('Enter your Name: '))
    firstScore = int(float(input('First test score: ').replace('%', '')))
    secondScore = int(float(input('Second test score: ').replace('%', '')))
    thirdScore = int(float(input('Third test score: ').replace('%', '')))
    scoreAvg = (firstScore + secondScore + thirdScore) / 3

    def grade():
        if scoreAvg >= 93 and <= 100:
            return 'A'
        if scoreAvg <= 92.9 and >= 89:
            return 'A-'
        if scoreAvg <= 88.9 and >= 87:
            return 'B+'
        if scoreAvg <= 86.9 and >= 83:
            return 'B'
        if scoreAvg <= 82.9 and >= 79:
            return 'B-'
        if scoreAvg <= 78.9 and >= 77:
            return 'C+'
        if scoreAvg <= 76.9 and >= 73:
            return 'C'
        if scoreAvg <= 72.9 and >= 69:
            return 'C-'
        if scoreAvg <= 68.9 and >= 67:
            return 'D+'
        if scoreAvg <= 66.9 and >= 60:
            return 'D'
        return 'F'

    print(grade(scoreAvg))
    print(studentName, "test score is: ",scoreAvg,'%')


    endProgram = input ('Do you want to restart the program?')

    if endProgram in ('no', 'No', 'NO', 'false', 'False', 'FALSE'):
        break

SyntaxError: invalid syntax (<ipython-input-54-e5dd2c831e5f>, line 13)

In [ ]:
while True:

    print("What is your Score out of 80?")
    score = input()

first = int(input("What was your mark:"))
Marks = int(input("Enter what the test was out of :"))
result = first / Marks * 100
print(first ,"/" ,Marks, '*' ,100 ,"=" , result, "%" )


if result > 90:
    print("You received an A*")

elif result > 70 and 90 :
    print("You received a A")

elif result > 60 and 70 :
    print("You received a B")

elif result > 50 and 60 :
    print("You received a C")

elif result < 50:   
    print("You received an D, and have Failed")


ans = no
input("Would you like to continue using the program?")

What is your Score out of 80?
34
What is your Score out of 80?
545
What is your Score out of 80?
45
What is your Score out of 80?
546
What is your Score out of 80?

What is your Score out of 80?
45
What is your Score out of 80?
54
What is your Score out of 80?
5
What is your Score out of 80?
45
What is your Score out of 80?
5
What is your Score out of 80?
5
What is your Score out of 80?
6
What is your Score out of 80?
6
What is your Score out of 80?
6
What is your Score out of 80?
6
What is your Score out of 80?
6
What is your Score out of 80?
77
What is your Score out of 80?
4
What is your Score out of 80?
6
What is your Score out of 80?
7
What is your Score out of 80?
6
What is your Score out of 80?
6
What is your Score out of 80?
67
What is your Score out of 80?
43
What is your Score out of 80?
56
What is your Score out of 80?
7
What is your Score out of 80?
g
What is your Score out of 80?
65
What is your Score out of 80?
56u
What is your Score out of 80?
56u
What is your Score out of 80?
u
What is your Score out of 80?
u
What is your Score out of 80?
56y
What is your Score out of 80?
r
What is your Score out of 80?
yrt
What is your Score out of 80?
65
What is your Score out of 80?
56
What is your Score out of 80?
ju
What is your Score out of 80?